"use client"

import styles from './chart_z.module.css'
import { LineChart, Line, XAxis, YAxis, Tooltip, Legend, ResponsiveContainer } from 'recharts';

const data = [
  {
    "Год": 2009,
    "Валовая": 111213691,
    "От продаж": 66657912,
    "Чистая": 33480015,
    "Коммерческие": 25121442,
    "Управленческие": 19434337
  },
  {
    "Год": 2010,
    "Валовая": 118167565,
    "От продаж": 65945486,
    "Чистая": 27428577,
    "Коммерческие": 33089665,
    "Управленческие": 19132414
  },
  {
    "Год": 2011,
    "Валовая": 122456796,
    "От продаж": 64595493,
    "Чистая": 54129288,
    "Коммерческие": 36569705,
    "Управленческие": 21300598
  },
  {
    "Год": 2012,
    "Валовая": 127934453,
    "От продаж": 70190971,
    "Чистая": 42949463,
    "Коммерческие": 33241387,
    "Управленческие": 24502095
  },
  {
    "Год": 2013,
    "Валовая": 145256787,
    "От продаж": 73478290,
    "Чистая": 55999090,
    "Коммерческие": 44177545,
    "Управленческие": 27609952
  },
  {
    "Год": 2014,
    "Валовая": 150368668,
    "От продаж": 74377911,
    "Чистая": 28372745,
    "Коммерческие": 47474858,
    "Управленческие": 28515899
  },
  {
    "Год": 2015,
    "Валовая": 148330805,
    "От продаж": 72827733,
    "Чистая": 6590503,
    "Коммерческие": 46845936,
    "Управленческие": 28657136
  },
  {
    "Год": 2016,
    "Валовая": 148855198,
    "От продаж": 70778305,
    "Чистая": 50658752,
    "Коммерческие": 48182276,
    "Управленческие": 29894617
  }
];

const Chart_z = () => {
  return (
    <div className={styles.container}>
      <h2 className={styles.title}>Прибыль</h2>
      <ResponsiveContainer width="100%" height="90%">
        <LineChart
          width={500}
          height={300}
          data={data}
          margin={{
            top: 5,
            right: 30,
            left: 20,
            bottom: 5,
          }}
        >
          <XAxis dataKey="Год" />
          <YAxis />
          <Tooltip contentStyle={{background:"#151c2c", border:"none"}}/>
          <Legend />
          <Line type="monotone" dataKey="Коммерческие" stroke="#8884d8" strokeDasharray="5 5" />
          <Line type="monotone" dataKey="Управленческие" stroke="#82ca9d" strokeDasharray="3 4 5 2" />

        </LineChart>
      </ResponsiveContainer>
    </div>
  )
}

export default Chart_z